#+TITLE: Devuan GNU+Linux
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+STARTUP: showall

* Network
#+begin_src bash :results drawer
  cat /etc/network/interfaces
#+end_src

#+RESULTS:
:results:
# interfaces(5) file used by ifup(8) and ifdown(8)
# Include files from /etc/network/interfaces.d:
source /etc/network/interfaces.d/*

# The loopback network interface
auto lo
iface lo inet loopback

# The primary network interface
allow-hotplug eth0
auto eth0
iface eth0 inet dhcp
:end:

* Configure the system
#+begin_src bash
  bind '"\e[A": history-search-backward'
  bind '"\e[B": history-search-forward'
#+end_src

#+begin_src bash :results drawer
  cat /etc/apt/sources.list
#+end_src

#+RESULTS:
:results:
deb https://pkgmaster.devuan.org/merged daedalus           main contrib non-free non-free-firmware
deb https://pkgmaster.devuan.org/merged daedalus-security  main contrib non-free non-free-firmware
deb https://pkgmaster.devuan.org/merged daedalus-updates   main contrib non-free non-free-firmware
deb https://pkgmaster.devuan.org/merged daedalus-backports main contrib non-free non-free-firmware
:end:

#+begin_src bash
  apt update
  apt upgrade
  apt install firmware-linux-free firmware-linux-nonfree firmware-realtek
  apt install gawk mawk- fonts-terminus locales console-setup
  dpkg-reconfigure keyboard-configuration
  dpkg-reconfigure console-setup
  dpkg-reconfigure tzdata
  apt install openssh-server openssh-client
  apt install man-db manpages manpages-dev
  apt install pciutils file traceroute mime-support lsof curl wget plocate nmap ncat bc psmisc git silversearcher-ag build-essential fortune-mod fortunes fortunes-debian-hints flex bison aptitude debootstrap gpm chrony ncal evtest ripgrep htop ckermit tio deborphan imagemagick rpm sqlite3
#+end_src

